examples/online_serving/disaggregated_serving_p2p_nccl_xpyd/benchmark_output/P_tp4_dp1_D_tp4_dp1/benchmark.log
INFO 11-04 05:22:25 [__init__.py:225] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x79a425cfc5e0>, seed=1762233743, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=10001, endpoint='/v1/completions', header=None, max_concurrency=64, model='meta-llama/Meta-Llama-3-70B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 11-04 05:22:31 [datasets.py:603] Sampling input_len from [511, 511] and output_len from [512, 512]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:08 remaining
 |          | 00:28 elapsed, 5052:00:31 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:01<02:58,  1.41s/it]
  4%|▍         | 5/128 [00:01<00:31,  3.87it/s]
  6%|▋         | 8/128 [00:02<00:26,  4.47it/s]
 11%|█         | 14/128 [00:02<00:13,  8.18it/s]
 12%|█▎        | 16/128 [00:03<00:17,  6.44it/s]
 16%|█▌        | 20/128 [00:03<00:11,  9.02it/s]
 17%|█▋        | 22/128 [00:03<00:15,  6.85it/s]
 19%|█▉        | 24/128 [00:03<00:13,  7.72it/s]
 20%|██        | 26/128 [00:04<00:11,  8.67it/s]
 22%|██▏       | 28/128 [00:04<00:14,  6.78it/s]
 25%|██▌       | 32/128 [00:04<00:12,  7.40it/s]
 29%|██▉       | 37/128 [00:05<00:08, 10.51it/s]
 30%|███       | 39/128 [00:05<00:10,  8.40it/s]
 32%|███▏      | 41/128 [00:16<01:52,  1.30s/it]
 33%|███▎      | 42/128 [00:19<02:10,  1.52s/it]
 34%|███▎      | 43/128 [00:26<03:23,  2.40s/it]
 34%|███▍      | 44/128 [00:26<02:52,  2.05s/it]
 40%|███▉      | 51/128 [00:27<00:58,  1.32it/s]
 48%|████▊     | 61/128 [00:27<00:22,  2.96it/s]
 49%|████▉     | 63/128 [00:28<00:20,  3.12it/s]
 57%|█████▋    | 73/128 [00:28<00:10,  5.49it/s]
 66%|██████▌   | 84/128 [00:28<00:05,  8.57it/s]
 72%|███████▏  | 92/128 [00:29<00:03, 11.45it/s]
 80%|███████▉  | 102/128 [00:29<00:01, 15.98it/s]
 83%|████████▎ | 106/128 [00:29<00:01, 17.23it/s]
 86%|████████▌ | 110/128 [00:40<00:10,  1.70it/s]
 87%|████████▋ | 111/128 [00:41<00:10,  1.59it/s]
 89%|████████▉ | 114/128 [00:50<00:15,  1.11s/it]
 91%|█████████ | 116/128 [00:50<00:11,  1.02it/s]
 92%|█████████▏| 118/128 [00:51<00:07,  1.25it/s]
 94%|█████████▍| 120/128 [00:51<00:05,  1.55it/s]
 98%|█████████▊| 126/128 [00:51<00:00,  2.86it/s]
100%|██████████| 128/128 [00:51<00:00,  2.49it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  51.50     
Total input tokens:                      65408     
Total generated tokens:                  42204     
Request throughput (req/s):              2.49      
Output token throughput (tok/s):         819.47    
Peak output token throughput (tok/s):    1408.00   
Peak concurrent requests:                75.00     
Total Token throughput (tok/s):          2089.50   
---------------Time to First Token----------------
Mean TTFT (ms):                          1734.57   
Median TTFT (ms):                        1473.18   
P99 TTFT (ms):                           3717.64   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          55.74     
Median TPOT (ms):                        48.52     
P99 TPOT (ms):                           94.86     
---------------Inter-token Latency----------------
Mean ITL (ms):                           48.03     
Median ITL (ms):                         45.40     
P99 ITL (ms):                            89.49     
==================================================